app/controllers/fantasy_players_controller.rb

  def create
    @fantasy_player = current_user.fantasy_players.build(fantasy_player_params)

    if @fantasy_player.save
---
INSERT INTO "fantasy_players" ("target", "created_at", "updated_at", "user_id", "player_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["target", "yes"], ["created_at", "2017-11-30 22:30:26.739220"], ["updated_at", "2017-11-30 22:30:26.739220"], ["user_id", 11], ["player_id", 3]]

    def set_fantasy_player
      @fantasy_player = current_user.fantasy_players.find(params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]