app/controllers/players_controller.rb

INSERT INTO "players" ("name", "team", "bye", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Bobson"], ["team", "NYE"], ["bye", 1], ["created_at", "2017-11-30 16:16:36.785413"], ["updated_at", "2017-11-30 16:16:36.785413"]]
---
  def create
    @player = Player.new(player_params)

    if @player.save